global.Regex = {
  decimal : /^(?!0+(?:\.0+)?$)(?:[1-9]\d*|0)(?:\.\d{1,2})?$/,//保留俩位小数
  number:/^[0-9]*$/,//验证纯数字
  intege:/^-?[1-9]\d*$/,     //整数
  intege1:/^[1-9]\d*$/,     //正整数
  intege2:/^-[1-9]\d*$/,     //负整数
  intege3:/^(\d{1,2}(\.\d{1,2})?|100|100\.0|100\.00)$/,//1-100 保留两位小数
  intege4:/^(\d{1,10}(\.\d{1,2})?)$/,//10位以内数字, 保留两位小数
  intege5:/^[1-9][0-9]$|^0[1-9]$|^[2-9]$/,
  letterOrNumber:/^[a-zA-Z\d]+$/,//字母或数字 无特殊字符和中文
  zipCodeReg : /^\d{6}$/,//邮编
 //  idcardReg : /^[1-9]([0-9]{14}|[0-9]{17})$/,//身份证
  idcardReg : /^\d{17}(\d|x)$/i,//身份证
  mobile : /^1[3|4|5|7|8][0-9]{9}$/,//手机
  // mobile : /^1[0-9]{10}$/,//手机
  tel : /^(([0\+]\d{2,3}-)?(0\d{2,3})-)?(\d{7,8})(-(\d{3,}))?$/,//座机
  tel400: /^400[0-9]{7}/,//400电话
  email:/^\w+((-\w+)|(\.\w+))*\@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/, //邮件
  foreignPassport:/^[a-zA-Z]{5,17}$|^[a-zA-Z0-9]{5,17}$/,//外国护照
  HKPassport:/^[Hh]{1}([0-9]{10}|[0-9]{8})$/,//香港通行证
  MacaoPassport:/^[Mm]{1}([0-9]{10}|[0-9]{8})$/,//澳门通行证
  TWPassport:/^[0-9]{8}$|^[0-9]{10}$/,//台湾通行证
  NamePinyin:/^[a-zA-Z\s*]{1,21}$/,//姓名拼音
  licensePlate :/^[A-Za-z0-9]{6,7}$/,//车牌号码
  chinese:/^[\u4e00-\u9fa5]+$/,//纯中文
};